tap 'caskroom/fonts'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/tex'
tap 'neovim/neovim'

# Installed by modules/preflight 
# brew 'mas'

brew 'ack'
brew 'atdtool'
brew 'bash'
brew 'colordiff'
brew 'coreutils', args: ['with-gmp']
brew 'curl', args: ['with-libssh2']
brew 'ffmpeg', args: ['with-faac', 'with-fontconfig', 'with-freetype', 'with-libvorbis', 'with-libvpx', 'with-tools', 'with-theora', 'with-libvidstab', 'with-zeromq', 'with-libass']
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-pcre', 'with-persistent-https']
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'hg' # mercurial
brew 'hub'
brew 'imagemagick', args: ['with-fftw', 'with-fontconfig', 'with-ghostscript', 'with-liblqr', 'with-librsvg', 'with-webp', 'with-x11']
brew 'jq'
brew 'jsawk'
brew 'lynx'
brew 'mtr'
brew 'multitail'
brew 'mysql'
brew 'n'
brew 'neovim'
brew 'pandoc'
brew 'plantuml'
brew 'postgresql', args: ['with-dtrace', 'with-python']
brew 'pv'
brew 'python', args: ['with-tcl-tk']
brew 'python3'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 'rbenv-vars'
brew 'R', args: ['with-openblas']
brew 'shellcheck'
brew 'siege'
brew 'tidy-html5'
brew 'tree'
brew 'vim', args: ['with-lua', 'with-client-server', 'override-system-vi', 'with-tcl']
brew 'wget', args: ['with-pcre']
brew 'zsh'
brew 'zsh-completions'

mas 'feedly', id: 865500966
mas 'Memory Clean', id: 451444120
mas 'Parcel - Delivery Tracking', id: 639968404
mas 'Slack', id: 803453959

cask 'adium' # open source multi-protocol instant messaging client
cask 'bitbar' # Put the output from any script or program in your Mac OS X Menu Bar
cask 'cheatsheet'
cask 'firefox'
cask 'flux'
cask 'gitbook-editor'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'iterm2'
# cask 'java' ### Prompts for JDK ###
cask 'karabiner'
cask 'mactex'
cask 'markdown-service-tools'
cask 'noejectdelay'
cask 'nvalt'
cask 'prefs-editor'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quip'
cask 'rstudio'
cask 'seil'
cask 'spectacle'
cask 'suspicious-package'
cask 'tcl'
cask 'transmission'
cask 'valentina-studio'
cask 'vlc'
# cask 'xquartz' ### Hangs, cannot unmount DMG ""
